Revit 2026 API

# XYZDistanceTo Method

---

Returns the distance from this point to the specified point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DistanceTo(
	XYZ source
)
```
```vb
Public Function DistanceTo (
	source As XYZ
) As Double
```
```cpp
public:
double DistanceTo(
	XYZ^ source
)
```
```fsharp
member DistanceTo :
        source : XYZ -> float
```

#### Parameters

source XYZ
    The specified point.

#### Return Value

DoubleThe real number equal to the distance between the two points.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The distance between the two points is equal to the length of the vector that joins the two points.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace